# Emissivity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ThermalAsset..::..Emissivity Property
ThermalAsset Class See Also
---
The emissivity of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Emissivity { get; set; }
```

Visual Basic
---
```text
Public Property Emissivity As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Emissivity {
	double get ();
	void set (double value);
}
```

# Remarks
Values must be in the range 0 to 1.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for emissivity is out of range |

# See Also
ThermalAsset Class
Autodesk.Revit.DB Namespace